Revit 2027 API
ReferencePoint.Position Property
The position of the ReferencePoint.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Position { get; set; }
Public Property Position As XYZ
	Get
	Set
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
member Position : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when CoordinateSystem is set while the Reference property is not null, and the ReferencePoint is unable to move to the new location.
Remarks
This is an alternate interface to the property CoordinateSystem.Origin. When set, the effect is the same as setting the CoordinateSystem property to the same as its current value but with a different Origin.
See Also
Reference
ReferencePoint Class
Autodesk.Revit.DB Namespace